Getting Started With Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4,7,-5,6], index = ["d","b","a","c"])

In [9]:
obj2

d    4
b    7
a   -5
c    6
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
print(obj2["a"])

-5

In [12]:
obj2["d"] = 6

In [13]:
obj2[["c","a","d"]]

c    6
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    6
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c    12
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c     403.428793
dtype: float64

In [17]:
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
sdata = {"Melbourne": 36000, "Sydney" : 71000, "Canberra": 80000,"Birsbane" : 90000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Melbourne    36000
Sydney       71000
Canberra     80000
Birsbane     90000
dtype: int64

In [23]:
obj3.to_dict()

{'Melbourne': 36000, 'Sydney': 71000, 'Canberra': 80000, 'Birsbane': 90000}

In [24]:
obj2.to_dict()

{'d': 6, 'b': 7, 'a': -5, 'c': 6}

In [25]:
states = ["Darwin", "Melbourne", "Sydney", "Canberra", "Birsbane","Tasmania","Perth"]

In [26]:
obj4 = pd.Series(sdata, index = states)

In [27]:
obj4

Darwin           NaN
Melbourne    36000.0
Sydney       71000.0
Canberra     80000.0
Birsbane     90000.0
Tasmania         NaN
Perth            NaN
dtype: float64

In [28]:
pd.isna(obj4)

Darwin        True
Melbourne    False
Sydney       False
Canberra     False
Birsbane     False
Tasmania      True
Perth         True
dtype: bool

In [29]:
pd.notna(obj4)

Darwin       False
Melbourne     True
Sydney        True
Canberra      True
Birsbane      True
Tasmania     False
Perth        False
dtype: bool

In [30]:
obj3

Melbourne    36000
Sydney       71000
Canberra     80000
Birsbane     90000
dtype: int64

In [31]:
obj4

Darwin           NaN
Melbourne    36000.0
Sydney       71000.0
Canberra     80000.0
Birsbane     90000.0
Tasmania         NaN
Perth            NaN
dtype: float64

In [32]:
obj3 + obj4

Birsbane     180000.0
Canberra     160000.0
Darwin            NaN
Melbourne     72000.0
Perth             NaN
Sydney       142000.0
Tasmania          NaN
dtype: float64

In [33]:
# GIVING SERIES NAME
obj4.name = "population"

In [34]:
obj4.index.name = "state"

In [35]:
obj4

state
Darwin           NaN
Melbourne    36000.0
Sydney       71000.0
Canberra     80000.0
Birsbane     90000.0
Tasmania         NaN
Perth            NaN
Name: population, dtype: float64

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ["Bob","Steve","Jeff","Ryan"]

In [38]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

DataFrame

In [39]:
data = {"state" :["Melbourne","Melbourne","Sydney","Sydney","Darwin","Darwin"],
        "year" : [2021,2022,2023,2021,2022,2023],
        "pop" : [2.1,2.2,3.6,6.7,8.9,0.1]}
frame = pd.DataFrame(data)

In [40]:
frame

       state  year  pop
0  Melbourne  2021  2.1
1  Melbourne  2022  2.2
2     Sydney  2023  3.6
3     Sydney  2021  6.7
4     Darwin  2022  8.9
5     Darwin  2023  0.1

In [41]:
# Gives an first five row of data in Frame and you can add the number of row in it.
frame.head()

       state  year  pop
0  Melbourne  2021  2.1
1  Melbourne  2022  2.2
2     Sydney  2023  3.6
3     Sydney  2021  6.7
4     Darwin  2022  8.9

In [42]:
# putting parameter in head
frame.head(2)

       state  year  pop
0  Melbourne  2021  2.1
1  Melbourne  2022  2.2

In [43]:
# Gives last five row of data in Frame and add the number of row in it starting from last
frame.tail()

       state  year  pop
1  Melbourne  2022  2.2
2     Sydney  2023  3.6
3     Sydney  2021  6.7
4     Darwin  2022  8.9
5     Darwin  2023  0.1

In [44]:
frame.tail(2)

    state  year  pop
4  Darwin  2022  8.9
5  Darwin  2023  0.1

In [45]:
# Arranging data based on columns
pd.DataFrame(data,columns = ["year","state","pop"])

   year      state  pop
0  2021  Melbourne  2.1
1  2022  Melbourne  2.2
2  2023     Sydney  3.6
3  2021     Sydney  6.7
4  2022     Darwin  8.9
5  2023     Darwin  0.1

In [46]:
# Making another frame with another column
frame2 = pd.DataFrame(data, columns = ["year","state","pop","debt"])

In [47]:
frame2

   year      state  pop debt
0  2021  Melbourne  2.1  NaN
1  2022  Melbourne  2.2  NaN
2  2023     Sydney  3.6  NaN
3  2021     Sydney  6.7  NaN
4  2022     Darwin  8.9  NaN
5  2023     Darwin  0.1  NaN

In [48]:
# Accessing only one column in Frame
frame2["state"]

0    Melbourne
1    Melbourne
2       Sydney
3       Sydney
4       Darwin
5       Darwin
Name: state, dtype: object

In [49]:
frame.year

0    2021
1    2022
2    2023
3    2021
4    2022
5    2023
Name: year, dtype: int64

In [50]:
# Accessing row in frame
frame2.loc[1]

year          2022
state    Melbourne
pop            2.2
debt           NaN
Name: 1, dtype: object

In [51]:
frame2.loc[2]

year       2023
state    Sydney
pop         3.6
debt        NaN
Name: 2, dtype: object

In [52]:
frame2

   year      state  pop debt
0  2021  Melbourne  2.1  NaN
1  2022  Melbourne  2.2  NaN
2  2023     Sydney  3.6  NaN
3  2021     Sydney  6.7  NaN
4  2022     Darwin  8.9  NaN
5  2023     Darwin  0.1  NaN

In [53]:
# changing column data 
frame2["debt"] = 16.5

In [54]:
frame2

   year      state  pop  debt
0  2021  Melbourne  2.1  16.5
1  2022  Melbourne  2.2  16.5
2  2023     Sydney  3.6  16.5
3  2021     Sydney  6.7  16.5
4  2022     Darwin  8.9  16.5
5  2023     Darwin  0.1  16.5

In [55]:
frame2["debt"] = np.arange(6.)

In [56]:
frame2

   year      state  pop  debt
0  2021  Melbourne  2.1   0.0
1  2022  Melbourne  2.2   1.0
2  2023     Sydney  3.6   2.0
3  2021     Sydney  6.7   3.0
4  2022     Darwin  8.9   4.0
5  2023     Darwin  0.1   5.0

In [57]:
# Adding new column and checking condition
frame2["Eastern"] = frame2["state"] == "Melbourne"

In [58]:
frame2

   year      state  pop  debt  Eastern
0  2021  Melbourne  2.1   0.0     True
1  2022  Melbourne  2.2   1.0     True
2  2023     Sydney  3.6   2.0    False
3  2021     Sydney  6.7   3.0    False
4  2022     Darwin  8.9   4.0    False
5  2023     Darwin  0.1   5.0    False

In [59]:
# deleting column
del frame2["Eastern"]

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
# Nested Dictionary is another form of data
populations = {"Melbourne" : {2021: 20000, 2022: 21000,2023:23000}, "Sydney" : {2021: 200000, 2022: 222000,2023:223000}, 
               "Darwin": {2021: 2000, 2022: 2100,2023:2300}}

In [62]:
frame3 = DataFrame(populations)

NameError: name 'DataFrame' is not defined

In [ ]:
frame3

In [63]:
frame3.T

NameError: name 'frame3' is not defined

In [64]:
frame3.index.name = "year"

NameError: name 'frame3' is not defined

In [65]:
frame3.columns.name = "state"

NameError: name 'frame3' is not defined

In [66]:
frame3

NameError: name 'frame3' is not defined

In [67]:
# Converting frame into numpy
frame3.to_numpy()

NameError: name 'frame3' is not defined

In [68]:
frame2.to_numpy()

array([[2021, 'Melbourne', 2.1, 0.0],
       [2022, 'Melbourne', 2.2, 1.0],
       [2023, 'Sydney', 3.6, 2.0],
       [2021, 'Sydney', 6.7, 3.0],
       [2022, 'Darwin', 8.9, 4.0],
       [2023, 'Darwin', 0.1, 5.0]], dtype=object)

In [69]:
frame2

   year      state  pop  debt
0  2021  Melbourne  2.1   0.0
1  2022  Melbourne  2.2   1.0
2  2023     Sydney  3.6   2.0
3  2021     Sydney  6.7   3.0
4  2022     Darwin  8.9   4.0
5  2023     Darwin  0.1   5.0

Index Objects

In [70]:
obj = pd.Series(np.arange(3), index = ["a","b","c"])

In [71]:
obj

a    0
b    1
c    2
dtype: int64

In [72]:
index = obj.index

In [73]:
index

Index(['a', 'b', 'c'], dtype='object')

In [74]:
labels = pd.Index(np.arange(3))

In [75]:
labels

Index([0, 1, 2], dtype='int64')

In [76]:
obj2 = pd.Series([1.5,-2.5,0], index = labels)

In [77]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [78]:
frame3

NameError: name 'frame3' is not defined

In [79]:
# Accessing Column Name
frame3.columns

NameError: name 'frame3' is not defined

In [80]:
# checking whether column in frame or not
"Melbourne" in frame3.columns

NameError: name 'frame3' is not defined

In [81]:
# checkinh whether 
2002 in frame3.columns

NameError: name 'frame3' is not defined

In [82]:
# Index can have duplicate labels
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Essential Functionality

In [83]:
# Reindexing
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [84]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [85]:
obj.reindex(["a","b","c","d","e"])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [86]:
obj3 = pd.Series(["Yellow","Blue","White"],index = [1,3,5])

In [87]:
obj3

1    Yellow
3      Blue
5     White
dtype: object

In [88]:
obj3.reindex(np.arange(6), method = "ffill")

0       NaN
1    Yellow
2    Yellow
3      Blue
4      Blue
5     White
dtype: object

In [89]:
frame = pd.DataFrame(np.arange(9.).reshape((3,3)),
                     index = ["x","y","z"],
                     columns = ["Sydney","Melbourne","Canberra"])

In [90]:
frame

   Sydney  Melbourne  Canberra
x     0.0        1.0       2.0
y     3.0        4.0       5.0
z     6.0        7.0       8.0

In [91]:
frame2 = frame.reindex(index = ["w","x","y","z"])

In [92]:
frame2

   Sydney  Melbourne  Canberra
w     NaN        NaN       NaN
x     0.0        1.0       2.0
y     3.0        4.0       5.0
z     6.0        7.0       8.0

In [93]:
# reindex with columns
states = ["Melbourne","Canberra","Sydney","Darwin"]

In [94]:
frame.reindex(columns = states)

   Melbourne  Canberra  Sydney  Darwin
x        1.0       2.0     0.0     NaN
y        4.0       5.0     3.0     NaN
z        7.0       8.0     6.0     NaN

In [95]:
# reindex of columns with another method
frame.reindex(states, axis = "columns")

   Melbourne  Canberra  Sydney  Darwin
x        1.0       2.0     0.0     NaN
y        4.0       5.0     3.0     NaN
z        7.0       8.0     6.0     NaN

In [96]:
frame

   Sydney  Melbourne  Canberra
x     0.0        1.0       2.0
y     3.0        4.0       5.0
z     6.0        7.0       8.0

In [97]:
frame.loc[["y","z"],["Melbourne","Sydney"]]

   Melbourne  Sydney
y        4.0     3.0
z        7.0     6.0

In [98]:
# Dropping Entries from an Axis
obj = pd.Series(np.arange(5), index = ["e","d","c","b","a"])

In [99]:
obj

e    0
d    1
c    2
b    3
a    4
dtype: int64

In [100]:
new_obj = obj.drop("c")

In [101]:
new_obj

e    0
d    1
b    3
a    4
dtype: int64

In [102]:
new_obj.drop(["a","b"])

e    0
d    1
dtype: int64

In [103]:
# Making new data frame
data = pd.DataFrame(np.arange(1,17).reshape(4,4),index = ["Melbourne","Sydney","Perth","Tasmania"],columns = ["w","x","y","z"])

In [104]:
data

            w   x   y   z
Melbourne   1   2   3   4
Sydney      5   6   7   8
Perth       9  10  11  12
Tasmania   13  14  15  16

In [105]:
# dropping with index
data.drop(index = ["Perth","Tasmania"])

           w  x  y  z
Melbourne  1  2  3  4
Sydney     5  6  7  8

In [106]:
# drop with columns
data.drop(columns = ["z"])

            w   x   y
Melbourne   1   2   3
Sydney      5   6   7
Perth       9  10  11
Tasmania   13  14  15

In [107]:
# same like in numpy axis
data.drop("x", axis =1)

            w   y   z
Melbourne   1   3   4
Sydney      5   7   8
Perth       9  11  12
Tasmania   13  15  16

In [108]:
data.drop(["x","y"],axis = "columns")

            w   z
Melbourne   1   4
Sydney      5   8
Perth       9  12
Tasmania   13  16

Indexing,Selection, and Filtering

In [109]:
obj = pd.Series(np.arange(4.),index = ["a","b","c","d"])

In [110]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [111]:
print(obj["b"])

1.0

In [112]:
print(obj.iloc[1])

1.0

In [113]:
print(obj.iloc[2:4])

c    2.0
d    3.0
dtype: float64

In [114]:
print(obj[["b","a","d"]])

b    1.0
a    0.0
d    3.0
dtype: float64

In [115]:
# loc operator
obj.loc[["a","b","d"]]

a    0.0
b    1.0
d    3.0
dtype: float64

In [116]:
obj1 = pd.Series([1,2,3], index = [2,0,1])

In [117]:
obj2 = pd.Series([1,2,3], index = ["a","b","c"])

In [118]:
obj1

2    1
0    2
1    3
dtype: int64

In [119]:
obj2

a    1
b    2
c    3
dtype: int64

In [120]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [121]:
obj2[[0,1,2]]

C:\Users\User\AppData\Local\Temp\ipykernel_17968\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [122]:
obj2.iloc[[0,1]]

a    1
b    2
dtype: int64

In [123]:
# slicing through loc, the endpoint is inclusive
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [124]:
# difference between iloc and loc
df = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]},index = ['a','b','c'])

In [125]:
df

   A  B
a  1  4
b  2  5
c  3  6

In [126]:
# Accessing data using loc
df.loc['a']

A    1
B    4
Name: a, dtype: int64

In [127]:
df.loc[['a','b']]

   A  B
a  1  4
b  2  5

In [128]:
print(df.loc['a','A'])

1

In [129]:
# Acessing through iloc
print(df.iloc[0])

A    1
B    4
Name: a, dtype: int64

In [130]:
(df.iloc[0][0])

C:\Users\User\AppData\Local\Temp\ipykernel_17968\3288096091.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  (df.iloc[0][0])

np.int64(1)

In [131]:
obj2

a    1
b    2
c    3
dtype: int64

In [132]:
obj2["b":"c"] = 5

In [133]:
obj2

a    1
b    5
c    5
dtype: int64

In [134]:
data

            w   x   y   z
Melbourne   1   2   3   4
Sydney      5   6   7   8
Perth       9  10  11  12
Tasmania   13  14  15  16

In [135]:
data[["x","y"]]

            x   y
Melbourne   2   3
Sydney      6   7
Perth      10  11
Tasmania   14  15

In [136]:
#Selecting through the index silicing
data[:2]

           w  x  y  z
Melbourne  1  2  3  4
Sydney     5  6  7  8

In [137]:
data < 5

               w      x      y      z
Melbourne   True   True   True   True
Sydney     False  False  False  False
Perth      False  False  False  False
Tasmania   False  False  False  False

Seletion on DataFrame with loc and iloc

In [138]:
data

            w   x   y   z
Melbourne   1   2   3   4
Sydney      5   6   7   8
Perth       9  10  11  12
Tasmania   13  14  15  16

In [139]:
# selecting loc to select data
data.loc["Melbourne"]

w    1
x    2
y    3
z    4
Name: Melbourne, dtype: int64

In [140]:
data.loc[["Melbourne","Sydney"]]

           w  x  y  z
Melbourne  1  2  3  4
Sydney     5  6  7  8

In [141]:
# selecting index and column using loc
data.loc[["Melbourne","Sydney"],["x","y"]]

           x  y
Melbourne  2  3
Sydney     6  7

In [142]:
# using iloc to select DataFrame
data.iloc[2]

w     9
x    10
y    11
z    12
Name: Perth, dtype: int64

In [143]:
# selecting row using index
data.iloc[[2,1]]

        w   x   y   z
Perth   9  10  11  12
Sydney  5   6   7   8

In [144]:
#selecting row and column with index
data.iloc[[2,1],[0,2,3]]

        w   y   z
Perth   9  11  12
Sydney  5   7   8

In [145]:
# slicing using loc
data.loc[:"Perth","x"]

Melbourne     2
Sydney        6
Perth        10
Name: x, dtype: int64

In [146]:
# slicing using iloc
data.iloc[:3,:]

           w   x   y   z
Melbourne  1   2   3   4
Sydney     5   6   7   8
Perth      9  10  11  12

In [147]:
data.iloc[:,:3]

            w   x   y
Melbourne   1   2   3
Sydney      5   6   7
Perth       9  10  11
Tasmania   13  14  15

Integer with pitfalls

In [148]:
data

            w   x   y   z
Melbourne   1   2   3   4
Sydney      5   6   7   8
Perth       9  10  11  12
Tasmania   13  14  15  16

In [153]:
data.loc['Melbourne']

w    1
x    2
y    3
z    4
Name: Melbourne, dtype: int64

In [155]:
data.loc[:,'x']

Melbourne     2
Sydney        6
Perth        10
Tasmania     14
Name: x, dtype: int64

Indexing with Pitfalls

In [156]:
ser = pd.Series(np.arange(3.))

In [157]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [158]:
ser2 = pd.Series(np.arange(3.), index = ["a","b","c"])

In [159]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [160]:
ser2[-1]

C:\Users\User\AppData\Local\Temp\ipykernel_17968\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

np.float64(2.0)

Arithemtic and Data Alignment

In [163]:
s1 = pd.Series([9.3,-0.25,4.33,2.34,3.4], index = ["a","b","c","d","e"])

In [165]:
s2 = pd.Series([-1.2,8.9,-1.5,5.1,3.1], index = ["a","c","e","f","g"])

In [166]:
s1

a    9.30
b   -0.25
c    4.33
d    2.34
e    3.40
dtype: float64

In [167]:
s2

a   -1.2
c    8.9
e   -1.5
f    5.1
g    3.1
dtype: float64

In [168]:
s1 + s2

a     8.10
b      NaN
c    13.23
d      NaN
e     1.90
f      NaN
g      NaN
dtype: float64

In [169]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns = list("abc"), index = ["Melbourne","Sydney","Canberra"])

In [172]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3),columns = list("bde"), index = ["Melbourne","Canberra","Darwin","Birsbane"])

In [173]:
df1

             a    b    c
Melbourne  0.0  1.0  2.0
Sydney     3.0  4.0  5.0
Canberra   6.0  7.0  8.0

In [174]:
df2

             b     d     e
Melbourne  0.0   1.0   2.0
Canberra   3.0   4.0   5.0
Darwin     6.0   7.0   8.0
Birsbane   9.0  10.0  11.0

In [175]:
df1 + df2

            a     b   c   d   e
Birsbane  NaN   NaN NaN NaN NaN
Canberra  NaN  10.0 NaN NaN NaN
Darwin    NaN   NaN NaN NaN NaN
Melbourne NaN   1.0 NaN NaN NaN
Sydney    NaN   NaN NaN NaN NaN

In [177]:
# Arthimetic methods with fill value
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns = list("abcd"))

In [178]:
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns = list("abcde"))

In [179]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [180]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [181]:
df2.loc[3,'e'] = np.nan

In [182]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0   NaN

In [183]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [184]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0   NaN

In [185]:
1/ df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [186]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [187]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Opertaions Between DataFrame and Series

In [3]:
arr = np.arange(12.).reshape(3,4)

In [4]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [5]:
arr[0]

array([0., 1., 2., 3.])

In [6]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [7]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),columns = list("bde"), index = ["Kathmandu", "Bhaktapur", "Laltipur", "Gorkha"])

In [8]:
frame

             b     d     e
Kathmandu  0.0   1.0   2.0
Bhaktapur  3.0   4.0   5.0
Laltipur   6.0   7.0   8.0
Gorkha     9.0  10.0  11.0

In [9]:
series = frame.iloc[0]

In [10]:
frame

             b     d     e
Kathmandu  0.0   1.0   2.0
Bhaktapur  3.0   4.0   5.0
Laltipur   6.0   7.0   8.0
Gorkha     9.0  10.0  11.0

In [11]:
series

b    0.0
d    1.0
e    2.0
Name: Kathmandu, dtype: float64

In [12]:
frame - series

             b    d    e
Kathmandu  0.0  0.0  0.0
Bhaktapur  3.0  3.0  3.0
Laltipur   6.0  6.0  6.0
Gorkha     9.0  9.0  9.0

In [14]:
series2 = pd.Series(np.arange(3.), index = ["b","e","f"])

In [15]:
series2

b    0.0
e    1.0
f    2.0
dtype: float64

In [16]:
frame + series2

             b   d     e   f
Kathmandu  0.0 NaN   3.0 NaN
Bhaktapur  3.0 NaN   6.0 NaN
Laltipur   6.0 NaN   9.0 NaN
Gorkha     9.0 NaN  12.0 NaN

In [18]:
series3 = frame["d"]

In [19]:
frame

             b     d     e
Kathmandu  0.0   1.0   2.0
Bhaktapur  3.0   4.0   5.0
Laltipur   6.0   7.0   8.0
Gorkha     9.0  10.0  11.0

In [20]:
series3

Kathmandu     1.0
Bhaktapur     4.0
Laltipur      7.0
Gorkha       10.0
Name: d, dtype: float64

In [21]:
frame.sub(series3, axis = "index")

             b    d    e
Kathmandu -1.0  0.0  1.0
Bhaktapur -1.0  0.0  1.0
Laltipur  -1.0  0.0  1.0
Gorkha    -1.0  0.0  1.0

Function Application and Mapping

In [23]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), columns = list("bde"), index = ["Melbourne", "Sydney","Canberra","Birsbane"])

In [24]:
frame

                  b         d         e
Melbourne -0.446036  0.081376 -0.421898
Sydney     0.443447 -1.108917 -0.640515
Canberra   0.903677 -2.050066 -0.011950
Birsbane  -2.587577 -0.136704  1.756914

In [25]:
np.abs(frame)

                  b         d         e
Melbourne  0.446036  0.081376  0.421898
Sydney     0.443447  1.108917  0.640515
Canberra   0.903677  2.050066  0.011950
Birsbane   2.587577  0.136704  1.756914

In [29]:
# making function call f1
def f1(x):
    return x.max() - x.min()

In [30]:
frame.apply(f1)

b    3.491253
d    2.131442
e    2.397429
dtype: float64

In [31]:
frame.apply(f1, axis = "columns")

Melbourne    0.527412
Sydney       1.552364
Canberra     2.953743
Birsbane     4.344491
dtype: float64

In [34]:
# Making function which returns min and max of frame
def f2(x):
    return pd.Series([x.min(), x.max()],index = ["min","max"])

In [35]:
frame.apply(f2)

            b         d         e
min -2.587577 -2.050066 -0.640515
max  0.903677  0.081376  1.756914

In [36]:
frame.apply(f2, axis = "columns")

                min       max
Melbourne -0.446036  0.081376
Sydney    -1.108917  0.443447
Canberra  -2.050066  0.903677
Birsbane  -2.587577  1.756914

In [38]:
# making function which returns frame multiply by .2
def my_format(x):
    return f"{x:.2f}"

In [41]:
frame.map(my_format)

               b      d      e
Melbourne  -0.45   0.08  -0.42
Sydney      0.44  -1.11  -0.64
Canberra    0.90  -2.05  -0.01
Birsbane   -2.59  -0.14   1.76

Sorting and Ranking

In [42]:
obj = pd.Series(np.arange(4), index = ["d","a","b","c"])

In [43]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [44]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [45]:
frame = pd.DataFrame(np.arange(8.).reshape((2,4)), index = ["three","one"], columns = list("dabc"))

In [46]:
frame

         d    a    b    c
three  0.0  1.0  2.0  3.0
one    4.0  5.0  6.0  7.0

In [47]:
frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [48]:
frame.sort_index(axis = "columns")

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [49]:
frame.sort_index(axis = "columns",ascending = False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [51]:
obj = pd.Series([4,-7,9,-9,3,2])

In [52]:
obj.sort_values()

3   -9
1   -7
5    2
4    3
0    4
2    9
dtype: int64

In [54]:
obj

0    4
1   -7
2    9
3   -9
4    3
5    2
dtype: int64

In [55]:
obj = pd.Series([4,np.nan,7,np.nan, -3,2])

In [56]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [57]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [59]:
obj.sort_values(na_position = "first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [62]:
frame = pd.DataFrame({"b":[4,7,-3,2], "a":[0,1,0,1]})

In [63]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [64]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [65]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [69]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [70]:
obj = pd.Series([7,5,-5,7,4,2,0,4,2])

In [71]:
obj.rank()

0    8.5
1    7.0
2    1.0
3    8.5
4    5.5
5    3.5
6    2.0
7    5.5
8    3.5
dtype: float64

In [72]:
obj.rank(method ="first")

0    8.0
1    7.0
2    1.0
3    9.0
4    5.0
5    3.0
6    2.0
7    6.0
8    4.0
dtype: float64

Axis Imdexes with Duplicate Labels

In [73]:
obj = pd.Series(np.arange(5), index = ["a","a","b","b","c"])

In [74]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [75]:
obj.index.is_unique

False

In [76]:
obj["a"]

a    0
a    1
dtype: int64

In [77]:
obj["c"]

np.int64(4)

In [81]:
df = pd.DataFrame(np.random.standard_normal((5,3)), index = ["a","a","b","b","c"])

In [82]:
df

          0         1         2
a  0.601624  0.118757 -1.313144
a -0.128656  1.268370  0.824739
b  0.284293 -0.906514 -1.267228
b  0.162157  0.588591  0.199033
c -0.576128 -2.432397  0.034648

In [83]:
df.loc['b']

          0         1         2
b  0.284293 -0.906514 -1.267228
b  0.162157  0.588591  0.199033

In [84]:
df.loc['c']

0   -0.576128
1   -2.432397
2    0.034648
Name: c, dtype: float64

Summarizing and computing Descriptive Statistics

In [85]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index = ["a","b","c","d"], columns = ["one","two"])

In [86]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [87]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [88]:
df.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [89]:
df.sum(axis = "index", skipna = False)

one   NaN
two   NaN
dtype: float64

In [90]:
df.sum(axis = "columns", skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [91]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [92]:
df.mean(axis = "columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [94]:
df.idxmax()

one    b
two    d
dtype: object

In [95]:
df.idxmin()

one    d
two    b
dtype: object

In [96]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [97]:
obj = pd.Series(["a","a","b","c"]*4)

In [98]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [99]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Correlation and Covariance

In [101]:
price = pd.read_pickle(r"D:\pythonForDataAnalysis\yahoo_price.pkl")

In [102]:
volume = pd.read_pickle(r"D:\pythonForDataAnalysis\yahoo_volume.pkl")

In [103]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [104]:
returns = price.pct_change()

In [105]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [106]:
returns["MSFT"].corr(returns["IBM"])

np.float64(0.4997636114415114)

In [107]:
returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703545e-05)

In [108]:
returns.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [109]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [110]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [112]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [113]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

Unique Values, Values Counts and Membership

In [114]:
obj = pd.Series(["c","a","d","a","a","b","b","c","c"])

In [115]:
uniques = obj.unique()

In [116]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [117]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [118]:
pd.value_counts(obj.to_numpy(), sort = False)

C:\Users\User\AppData\Local\Temp\ipykernel_4104\2072757793.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort = False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [119]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [120]:
mask = obj.isin(["b","c"])

In [121]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [122]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [123]:
data = pd.DataFrame({"Q1" : [1,3,4,3,4],
                     "Q2" : [2,3,1,2,3],
                     "Q3" : [1,5,2,4,4]})

In [124]:
data

   Q1  Q2  Q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

AttributeError: 'function' object has no attribute 'sort_index'